// Підключаємо технологію express для back-end сервера
const express = require('express')
// Cтворюємо роутер - місце, куди ми підключаємо ендпоїнти
const router = express.Router()

// Підключіть файли роутів
const calc = require('./calc')

//Об'єднайте файли роутів зв потреби
router.use('/calc', calc)

// ==========================================s======================

// // router.get Створює нам один ентпоїнт

// // ↙️ тут вводимо шлях (PATH) до сторінки
// router.get('/', function (req, res) {
//   // res.render генерує нам HTML сторінку

//   // ↙️ cюди вводимо назву файлу з сontainer
//   res.render('index', {
//     // вказуємо назву папки контейнера, в якій знаходяться наші стилі
//     style: 'spotify-choose',

//     data: {},
//   })
//   // ↑↑ сюди вводимо JSON дані
// })

// ================================================================

// Підключаємо роутер до бек-енду
module.exports = router
